# FIT5196 Task X in Assessment 1
#### Student Name: Boyu Zhang
#### Student ID: 28491300

Date: XX/XX/XXXX

Version: 1.0

Environment: Python 3.6 and Jupyter notebook

Libraries used: please include the main libraries you used in your assignment here, e.g.,:
* pandas (for dataframe, included in Anaconda Python ) 
* re (for regular expression, included in Anaconda Python 3.6) 
* numpy (for numpy array, included in Anaconda Python 3.6) 

<font size=3, color="red"> Note: this is a sample notebook only. You will need to fill in the proper markdown and code blocks. You might also want to make necessary changes to the structure to meet your own needs. It is important to make sure the logic of how you finish the assessment is clearly shown in this notebook! </font>

## 1.  Import libraries

In [2]:
# Code to import libraries as you need in this assessment, e.g.,
import pandas as pd
import re

In [4]:
df2 = pd.read_csv('./Input/dataset2_integration.csv')

In [5]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25276 entries, 0 to 25275
Data columns (total 11 columns):
Id                  25276 non-null int64
Source Name         25276 non-null object
Title               25276 non-null object
location            25276 non-null object
Contract Type       4819 non-null object
Contract Time       19763 non-null object
Company             24178 non-null object
Category            25276 non-null object
Salary per month    25276 non-null int64
OpenDate            25276 non-null object
CloseDate           25276 non-null object
dtypes: int64(2), object(9)
memory usage: 2.1+ MB

In [6]:
df2.describe()

                 Id  Salary per month
count  2.527600e+04      25276.000000
mean   7.109038e+07       2935.074458
std    1.025040e+06       1315.875990
min    6.924768e+07        417.000000
25%    7.008671e+07       2000.000000
50%    7.129211e+07       2681.500000
75%    7.187785e+07       3542.000000
max    7.270520e+07       8000.000000

In [7]:
df2.describe(include=['O'])

,Source Name,Title,location,Contract Type,Contract Time,Company,Category,OpenDate,CloseDate
count,25276,25276,25276,4819,19763,24178,25276,25276,25276
unique,92,25276,475,2,2,5679,8,2193,2395
top,totaljobs.com,Optical Assistant Aldershot,UK,ft,perm.,UKStaffsearch,IT Jobs,2012-04-06 12:00:00,2013-07-31 12:00:00
freq,4799,1,4263,4353,16505,255,6854,28,25

In [8]:
df2.head()

,Id,Source Name,Title,location,Contract Type,Contract Time,Company,Category,Salary per month,OpenDate,CloseDate
0,69247680,jobs.guardian.co.uk,Business Development Exec research / insight ...,London,ft,perm.,BOYCE RECRUITMENT,"PR, Advertising & Marketing Jobs",2125,2012-03-01 15:00:00,2012-03-31 15:00:00
1,69247682,icaewjobs.com,Audit Senior London,London,ft,contr.,Pro Finance,Finance & Accounting Jobs,3600,2013-03-14 12:00:00,2013-04-13 12:00:00
2,69247685,jobs.guardian.co.uk,PR & Social Media Account Executive Top Inter...,Central London,ft,perm.,ECOM RECRUITMENT LTD,"PR, Advertising & Marketing Jobs",1917,2012-02-14 12:00:00,2012-03-15 12:00:00
3,69247688,jobs.guardian.co.uk,Content Manager,London,ft,perm.,NAKAMA LONDON,"PR, Advertising & Marketing Jobs",2083,2012-10-21 00:00:00,2012-12-20 00:00:00
4,69247694,jobs.guardian.co.uk,AV PRODUCTION MANAGER,Worcestershire,ft,perm.,LIVE RECRUITMENT,"PR, Advertising & Marketing Jobs",2292,2012-02-22 00:00:00,2012-04-22 00:00:00

## 2. Parse XXXX File

In this section, you can write your python scripts to parse the correspondiing file.
You should 
* write proper notes for all code block in this notebook using the Markdown cells
* provide proper comment in your scripts
* run all cells to make sure scripts are runable. If the scripts cannot be run by the assessors, they will not be assessed and zero mark will be given to the task.

In [11]:
df2['Contract Type'].unique()

array(['ft', nan, 'pt'], dtype=object)

In [12]:
df2['Contract Time'].unique()

array(['perm.', 'contr.', nan], dtype=object)

## Potential integration issue at first glance:
- Different representation of `Contract Type` ad `Contract Time` in dataset1 and dataset2
- Different unit for `Salary`
- duplicated records(can be solved only when all format and units are uniformed first)

## 3. Summary
Give a short summary of your work done above, such as your findings.